[
  {
    "id": "disease-powdery-mildew",
    "name": "Powdery Mildew",
    "description": "A fungal disease that appears as white or grayish powdery spots on leaves and stems. Thrives in moderate temperatures and high humidity with poor air circulation.",
    "symptoms": [
      "White or gray powdery patches on leaves, stems, and flowers",
      "Leaves may yellow, dry out, and drop prematurely",
      "Distorted new growth",
      "Reduced plant vigor and flowering"
    ],
    "treatmentMethods": [
      "Improve air circulation around plants",
      "Remove and destroy infected plant parts",
      "Fungicide sprays (e.g., neem oil, potassium bicarbonate, or sulfur-based)",
      "Avoid overhead watering, water at the base of the plant"
    ],
    "imageUrl": "https://static.inaturalist.org/photos/484991230/medium.jpg"
  },
  {
    "id": "disease-root-rot",
    "name": "Root Rot",
    "description": "Caused by overwatering and poorly draining soil, leading to oxygen deprivation and fungal/bacterial growth on roots. Roots become mushy and brown/black.",
    "symptoms": [
      "Wilting leaves, even when soil is moist",
      "Yellowing or browning leaves, starting from the bottom of the plant",
      "Stunted growth or leaf drop",
      "Mushy, dark, and foul-smelling roots (if plant is unpotted for inspection)"
    ],
    "treatmentMethods": [
      "Allow soil to dry completely before re-evaluating watering needs",
      "Ensure pots have adequate drainage holes and use a well-draining potting mix",
      "For affected plants: remove, trim away rotted roots with sterile tool, repot in fresh sterile soil",
      "Water less frequently; check soil moisture before watering"
    ],
    "imageUrl": "https://img.freepik.com/free-photo/close-up-hands-holding-plant_23-2149235704.jpg?uid=R52714011&ga=GA1.1.1920374923.1746213970&semt=ais_hybrid&w=740"
  },
  {
    "id": "disease-fungal-leaf-spot",
    "name": "Fungal Leaf Spot",
    "description": "A common group of diseases caused by various fungi, resulting in spots on plant leaves. Spot appearance (color, size, shape) can vary widely based on the specific fungus and plant.",
    "symptoms": [
      "Circular or irregular spots on leaves (often brown, black, tan, or yellow)",
      "Spots may develop a distinct border, a target-like pattern, or a colored halo",
      "Affected leaf tissue may die and fall out, creating a 'shot-hole' appearance",
      "Severe infections can lead to significant leaf drop and reduced plant health"
    ],
    "treatmentMethods": [
      "Remove and destroy affected leaves immediately to reduce spore spread",
      "Improve air circulation and avoid prolonged leaf wetness by watering at the soil level",
      "Apply appropriate fungicides (copper-based, neem oil, or specific to fungus type) if problem persists",
      "Clean up fallen debris around plants regularly"
    ],
    "imageUrl": "https://images.unsplash.com/photo-1601398853894-77e46fe390c2?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8Nnx8ZnVuZ2FsJTIwZGlzZXNlJTIwbGVhZnxlbnwwfHwwfHx8MA%3D%3D"
  },
  {
    "id": "disease-damping-off",
    "name": "Damping Off",
    "description": "A soil-borne fungal disease primarily affecting seedlings, causing them to rot at the soil line and collapse. Often occurs in overly wet, cool conditions with poor air circulation.",
    "symptoms": [
      "Seedlings fail to emerge from the soil",
      "Emerged seedlings suddenly wilt and collapse at the soil line",
      "Stems appear constricted, water-soaked, or discolored near the soil",
      "White, cobweb-like fungal growth may be visible on soil or affected seedlings"
    ],
    "treatmentMethods": [
      "Use sterile seed-starting mix and clean containers",
      "Avoid overwatering; keep soil consistently moist but not waterlogged",
      "Ensure good air circulation around seedlings (e.g., a small fan)",
      "Sow seeds thinly to prevent overcrowding",
      "Once started, there's no cure for affected seedlings; remove them to prevent spread"
    ],
    "imageUrl": null 
  }
]
